<?xml version="1.0"?>
<GCC_XML cvs_revision="1.134">

    <Argument name="__nreal" type="_525" location="f3:362" file="f3" line="362"/>
  </Function>
  <Typedef id="_765" name="__ino64_t" type="_726" context="_1" location="f12:138" file="f12" line="138"/>
  <Function id="_766" name="__builtin_sinf" returns="_796" context="_1" mangled="sinf" location="f2:76" file="f2" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_796" location="f2:76" file="f2" line="76"/>
  </Function>
  <Function id="_767" name="__builtin_sinh" returns="_794" context="_1" mangled="sinh" location="f2:77" file="f2" line="77" extern="1" attributes="nothrow">
    <Argument type="_794" location="f2:77" file="f2" line="77"/>
  </Function>
  <Function id="_768" name="__builtin_sinl" returns="_797" context="_1" mangled="sinl" location="f2:80" file="f2" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_797" location="f2:80" file="f2" line="80"/>
  </Function>
  <Function id="_769" name="git_tag_set_message" returns="_827" context="_1" location="f20:141" file="f20" line="141" extern="1" attributes="visibility(default)">
    <Argument name="tag" type="_965" location="f20:141" file="f20" line="141"/>
    <Argument name="message" type="_795" location="f20:141" file="f20" line="141"/>
  </Function>
  <Function id="_770" name="deflateBound" returns="_746" context="_1" location="f4:680" file="f4" line="680" extern="1">
    <Argument name="strm" type="_424" location="f4:680" file="f4" line="680"/>
    <Argument name="sourceLen" type="_746" location="f4:680" file="f4" line="680"/>
  </Function>
  <Function id="_771" name="lockf64" returns="_91" context="_1" location="f1:1101" file="f1" line="1101" extern="1" attributes="__warn_unused_result__">
    <Argument name="__fd" type="_91" location="f1:1101" file="f1" line="1101"/>
    <Argument name="__cmd" type="_91" location="f1:1101" file="f1" line="1101"/>
    <Argument name="__len" type="_640" location="f1:1101" file="f1" line="1101"/>
  </Function>
  <Function id="_772" name="git_odb_new" returns="_91" context="_1" location="f11:52" file="f11" line="52" extern="1" attributes="visibility(default)">
    <Argument name="out" type="_853" location="f11:52" file="f11" line="52"/>
  </Function>
  <Typedef id="_773" name="uint64_t" type="_18" context="_1" location="f7:59" file="f7" line="59"/>
  <Function id="_774" name="__builtin_csin" returns="_844" context="_1" mangled="csin" location="f2:115" file="f2" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_844" location="f2:115" file="f2" line="115"/>
  </Function>
  <Typedef id="_775" name="__clock_t" type="_16" context="_1" location="f12:145" file="f12" line="145"/>
  <Function id="_776" name="getpass" returns="_677" context="_1" location="f1:967" file="f1" line="967" extern="1" attributes="__nonnull__()">
    <Argument name="__prompt" type="_795" location="f1:967" file="f1" line="967"/>
  </Function>
  <Function id="_777" name="gzclearerr" returns="_827" context="_1" location="f4:1338" file="f4" line="1338" extern="1">
    <Argument name="file" type="_645" location="f4:1338" file="f4" line="1338"/>
  </Function>
  <Function id="_778" name="ftruncate" returns="_91" throw="" context="_1" location="f1:1026" file="f1" line="1026" extern="1" attributes="__warn_unused_result__">
    <Argument name="__fd" type="_91" location="f1:1026" file="f1" line="1026"/>
    <Argument name="__length" type="_481" location="f1:1026" file="f1" line="1026"/>
  </Function>
  <Function id="_779" name="git_tag_id" returns="_832" context="_1" location="f20:78" file="f20" line="78" extern="1" attributes="visibility(default)">
    <Argument name="tag" type="_965" location="f20:78" file="f20" line="78"/>
  </Function>
  <Typedef id="_780" name="__int32_t" type="_91" context="_1" location="f12:41" file="f12" line="41"/>
  <Typedef id="_781" name="gz_header" type="_229" context="_1" location="f4:127" file="f4" line="127"/>
  <Function id="_782" name="git_commit_set_committer" returns="_827" context="_1" location="f22:166" file="f22" line="166" extern="1" attributes="visibility(default)">
    <Argument name="commit" type="_855" location="f22:166" file="f22" line="166"/>
    <Argument name="committer_sig" type="_1033" location="f22:166" file="f22" line="166"/>
  </Function>
  <Function id="_783" name="git_reference_create_oid" returns="_91" context="_1" location="f19:86" file="f19" line="86" extern="1" attributes="visibility(default)">
    <Argument name="ref_out" type="_850" location="f19:86" file="f19" line="86"/>
    <Argument name="repo" type="_829" location="f19:86" file="f19" line="86"/>
    <Argument name="name" type="_795" location="f19:86" file="f19" line="86"/>
    <Argument name="id" type="_832" location="f19:86" file="f19" line="86"/>
  </Function>
  <Function id="_784" name="gzungetc" returns="_91" context="_1" location="f4:1250" file="f4" line="1250" extern="1">
    <Argument name="c" type="_91" location="f4:1250" file="f4" line="1250"/>
    <Argument name="file" type="_645" location="f4:1250" file="f4" line="1250"/>
  </Function>
  <Function id="_785" name="git_object_typeisloose" returns="_91" context="_1" location="f9:179" file="f9" line="179" extern="1" attributes="visibility(default)">
    <Argument name="type" type="_156" location="f9:179" file="f9" line="179"/>
  </Function>
  <Function id="_786" name="readlinkat" returns="_510" throw="" context="_1" location="f3:174" file="f3" line="174" endline="174" inline="1" attributes="__gnu_inline__ __always_inline__ __warn_unused_result__ __nonnull__(,)">
    <Argument name="__fd" type="_91" location="f3:174" file="f3" line="174"/>
    <Argument name="__path" type="_795r" location="f3:174" file="f3" line="174"/>
    <Argument name="__buf" type="_677r" location="f3:174" file="f3" line="174"/>
    <Argument name="__len" type="_525" location="f3:174" file="f3" line="174"/>
  </Function>
  <Typedef id="_787" name="__caddr_t" type="_677" context="_1" location="f12:186" file="f12" line="186"/>
  <Field id="_788" name="it_interval" type="_347" offset="0" context="_3" access="public" location="f0:163" file="f0" line="163"/>
  <Field id="_789" name="it_value" type="_347" offset="64" context="_3" access="public" location="f0:164" file="f0" line="164"/>
  <Destructor id="_790" name="itimerspec" artificial="1" throw="" context="_3" access="public" mangled="_ZN10itimerspecD1Ev *INTERNAL* " demangled="itimerspec::~itimerspec()" location="f0:162" file="f0" line="162" endline="162" inline="1">
  </Destructor>
  <OperatorMethod id="_791" name="=" returns="_1088" artificial="1" throw="" context="_3" access="public" mangled="_ZN10itimerspecaSERKS_" demangled="itimerspec::operator=(itimerspec const&amp;)" location="f0:162" file="f0" line="162" endline="162" inline="1">
    <Argument type="_1089" location="f0:162" file="f0" line="162"/>
  </OperatorMethod>
  <Constructor id="_792" name="itimerspec" artificial="1" throw="" context="_3" access="public" mangled="_ZN10itimerspecC1ERKS_ *INTERNAL* " demangled="itimerspec::itimerspec(itimerspec const&amp;)" location="f0:162" file="f0" line="162" endline="162" inline="1">
    <Argument type="_1089" location="f0:162" file="f0" line="162"/>
  </Constructor>
  <Constructor id="_793" name="itimerspec" artificial="1" throw="" context="_3" access="public" mangled="_ZN10itimerspecC1Ev *INTERNAL* " demangled="itimerspec::itimerspec()" location="f0:162" file="f0" line="162" inline="1"/>
  <FundamentalType id="_794" name="double" size="64" align="64"/>
  <PointerType id="_795" type="_605c" size="32" align="32"/>
  <FundamentalType id="_796" name="float" size="32" align="32"/>
  <FundamentalType id="_797" name="long double" size="96" align="32"/>
  <Field id="_798" name="tv_sec" type="_474" offset="0" context="_11" access="public" location="f5:77" file="f5" line="77"/>
  <Field id="_799" name="tv_usec" type="_106" offset="32" context="_11" access="public" location="f5:78" file="f5" line="78"/>
  <Destructor id="_800" name="timeval" artificial="1" throw="" context="_11" access="public" mangled="_ZN7timevalD1Ev *INTERNAL* " demangled="timeval::~timeval()" location="f5:76" file="f5" line="76" endline="76" inline="1">
  </Destructor>
  <OperatorMethod id="_801" name="=" returns="_1091" artificial="1" throw="" context="_11" access="public" mangled="_ZN7timevalaSERKS_" demangled="timeval::operator=(timeval const&amp;)" location="f5:76" file="f5" line="76" endline="76" inline="1">
    <Argument type="_1092" location="f5:76" file="f5" line="76"/>
  </OperatorMethod>
  <Constructor id="_802" name="timeval" artificial="1" throw="" context="_11" access="public" mangled="_ZN7timevalC1ERKS_ *INTERNAL* " demangled="timeval::timeval(timeval const&amp;)" location="f5:76" file="f5" line="76" endline="76" inline="1">
    <Argument type="_1092" location="f5:76" file="f5" line="76"/>
  </Constructor>
  <Constructor id="_803" name="timeval" artificial="1" throw="" context="_11" access="public" mangled="_ZN7timevalC1Ev *INTERNAL* " demangled="timeval::timeval()" location="f5:76" file="f5" line="76" inline="1"/>
  <Field id="_804" name="tm_sec" type="_91" offset="0" context="_13" access="public" location="f0:135" file="f0" line="135"/>
  <Field id="_805" name="tm_min" type="_91" offset="32" context="_13" access="public" location="f0:136" file="f0" line="136"/>
  <Field id="_806" name="tm_hour" type="_91" offset="64" context="_13" access="public" location="f0:137" file="f0" line="137"/>
  <Field id="_807" name="tm_mday" type="_91" offset="96" context="_13" access="public" location="f0:138" file="f0" line="138"/>
  <Field id="_808" name="tm_mon" type="_91" offset="128" context="_13" access="public" location="f0:139" file="f0" line="139"/>
  <Field id="_809" name="tm_year" type="_91" offset="160" context="_13" access="public" location="f0:140" file="f0" line="140"/>
  <Field id="_810" name="tm_wday" type="_91" offset="192" context="_13" access="public" location="f0:141" file="f0" line="141"/>
  <Field id="_811" name="tm_yday" type="_91" offset="224" context="_13" access="public" location="f0:142" file="f0" line="142"/>
  <Field id="_812" name="tm_isdst" type="_91" offset="256" context="_13" access="public" location="f0:143" file="f0" line="143"/>
  <Field id="_813" name="tm_gmtoff" type="_16" offset="288" context="_13" access="public" location="f0:146" file="f0" line="146"/>
  <Field id="_814" name="tm_zone" type="_795" offset="320" context="_13" access="public" location="f0:147" file="f0" line="147"/>
  <Destructor id="_815" name="tm" artificial="1" throw="" context="_13" access="public" mangled="_ZN2tmD1Ev *INTERNAL* " demangled="tm::~tm()" location="f0:134" file="f0" line="134" endline="134" inline="1">
  </Destructor>
  <OperatorMethod id="_816" name="=" returns="_1093" artificial="1" throw="" context="_13" access="public" mangled="_ZN2tmaSERKS_" demangled="tm::operator=(tm const&amp;)" location="f0:134" file="f0" line="134" endline="134" inline="1">
    <Argument type="_1094" location="f0:134" file="f0" line="134"/>
  </OperatorMethod>
  <Constructor id="_817" name="tm" artificial="1" throw="" context="_13" access="public" mangled="_ZN2tmC1ERKS_ *INTERNAL* " demangled="tm::tm(tm const&amp;)" location="f0:134" file="f0" line="134" endline="134" inline="1">
    <Argument type="_1094" location="f0:134" file="f0" line="134"/>
  </Constructor>
  <Constructor id="_818" name="tm" artificial="1" throw="" context="_13" access="public" mangled="_ZN2tmC1Ev *INTERNAL* " demangled="tm::tm()" location="f0:134" file="f0" line="134" inline="1"/>
  <FundamentalType id="_819" name="bool" size="8" align="8"/>
  <CvQualifiedType id="_795r" type="_795" restrict="1"/>
  <CvQualifiedType id="_677r" type="_677" restrict="1"/>
  <FundamentalType id="_822" name="complex float" size="64" align="32"/>
  <FundamentalType id="_823" name="complex long double" size="192" align="32"/>
  <PointerType id="_824" type="_62c" size="32" align="32"/>
  <PointerType id="_825" type="_677c" size="32" align="32"/>
  <PointerType id="_826" type="_947" size="32" align="32"/>
  <FundamentalType id="_827" name="void" align="8"/>
  <PointerType id="_828" type="_138" size="32" align="32"/>
  <PointerType id="_829" type="_295" size="32" align="32"/>
  <PointerType id="_830" type="_671" size="32" align="32"/>
  <PointerType id="_831" type="_74" size="32" align="32"/>
  <PointerType id="_832" type="_621c" size="32" align="32"/>
  <Field id="_834" name="__val" type="_1098" offset="0" context="_54" access="public" location="f13:31" file="f13" line="31"/>
  <Destructor id="_835" name="._1" artificial="1" throw="" context="_54" access="public" mangled="_ZN10__sigset_tD1Ev *INTERNAL* " demangled="__sigset_t::~__sigset_t()" location="f13:32" file="f13" line="32" endline="32" inline="1">
  </Destructor>
  <OperatorMethod id="_836" name="=" returns="_1099" artificial="1" throw="" context="_54" access="public" mangled="_ZN10__sigset_taSERKS_" demangled="__sigset_t::operator=(__sigset_t const&amp;)" location="f13:32" file="f13" line="32" endline="32" inline="1">
    <Argument type="_1100" location="f13:30" file="f13" line="30"/>
  </OperatorMethod>
  <Constructor id="_837" name="._1" artificial="1" throw="" context="_54" access="public" mangled="_ZN10__sigset_tC1ERKS_ *INTERNAL* " demangled="__sigset_t::__sigset_t(__sigset_t const&amp;)" location="f13:32" file="f13" line="32" endline="32" inline="1">
    <Argument type="_1100" location="f13:30" file="f13" line="30"/>
  </Constructor>
  <Constructor id="_838" name="._1" artificial="1" throw="" context="_54" access="public" mangled="_ZN10__sigset_tC1Ev *INTERNAL* " demangled="__sigset_t::__sigset_t()" location="f13:32" file="f13" line="32" inline="1"/>
  <Field id="_839" name="__next" type="_1101" offset="0" context="_56" access="public" location="f15:69" file="f15" line="69"/>
  <Destructor id="_840" name="__pthread_internal_slist" artificial="1" throw="" context="_56" access="public" mangled="_ZN24__pthread_internal_slistD1Ev *INTERNAL* " demangled="__pthread_internal_slist::~__pthread_internal_slist()" location="f15:68" file="f15" line="68" endline="68" inline="1">
  </Destructor>
  <OperatorMethod id="_841" name="=" returns="_1102" artificial="1" throw="" context="_56" access="public" mangled="_ZN24__pthread_internal_slistaSERKS_" demangled="__pthread_internal_slist::operator=(__pthread_internal_slist const&amp;)" location="f15:68" file="f15" line="68" endline="68" inline="1">
    <Argument type="_1103" location="f15:68" file="f15" line="68"/>
  </OperatorMethod>
  <Constructor id="_842" name="__pthread_internal_slist" artificial="1" throw="" context="_56" access="public" mangled="_ZN24__pthread_internal_slistC1ERKS_ *INTERNAL* " demangled="__pthread_internal_slist::__pthread_internal_slist(__pthread_internal_slist const&amp;)" location="f15:68" file="f15" line="68" endline="68" inline="1">
    <Argument type="_1103" location="f15:68" file="f15" line="68"/>
  </Constructor>
  <Constructor id="_843" name="__pthread_internal_slist" artificial="1" throw="" context="_56" access="public" mangled="_ZN24__pthread_internal_slistC1Ev *INTERNAL* " demangled="__pthread_internal_slist::__pthread_internal_slist()" location="f15:68" file="f15" line="68" inline="1"/>
  <FundamentalType id="_844" name="complex double" size="128" align="64"/>
  <PointerType id="_845" type="_852" size="32" align="32"/>
  <PointerType id="_846" type="_62" size="32" align="32"/>
  <PointerType id="_847" type="_284" size="32" align="32"/>
  <PointerType id="_848" type="_965" size="32" align="32"/>
  <PointerType id="_850" type="_885" size="32" align="32"/>
  <PointerType id="_851" type="_654" size="32" align="32"/>
  <PointerType id="_852" type="_632" size="32" align="32"/>
  <PointerType id="_853" type="_831" size="32" align="32"/>
  <PointerType id="_854" type="_61" size="32" align="32"/>
  <PointerType id="_855" type="_272" size="32" align="32"/>
  <PointerType id="_856" type="_13" size="32" align="32"/>
  <Field id="_857" name="seconds" type="_157" offset="0" context="_136" access="public" location="f8:49" file="f8" line="49"/>
  <Field id="_858" name="nanoseconds" type="_70" offset="32" context="_136" access="public" location="f8:51" file="f8" line="51"/>
  <Destructor id="_859" name="._22" artificial="1" throw="" context="_136" access="public" mangled="_ZN14git_index_timeD1Ev *INTERNAL* " demangled="git_index_time::~git_index_time()" location="f8:52" file="f8" line="52" endline="52" inline="1">
  </Destructor>
  <OperatorMethod id="_860" name="=" returns="_1104" artificial="1" throw="" context="_136" access="public" mangled="_ZN14git_index_timeaSERKS_" demangled="git_index_time::operator=(git_index_time const&amp;)" location="f8:52" file="f8" line="52" endline="52" inline="1">
    <Argument type="_1105" location="f8:48" file="f8" line="48"/>
  </OperatorMethod>
  <Constructor id="_861" name="._22" artificial="1" throw="" context="_136" access="public" mangled="_ZN14git_index_timeC1ERKS_ *INTERNAL* " demangled="git_index_time::git_index_time(git_index_time const&amp;)" location="f8:52" file="f8" line="52" endline="52" inline="1">
    <Argument type="_1105" location="f8:48" file="f8" line="48"/>
  </Constructor>
  <Constructor id="_862" name="._22" artificial="1" throw="" context="_136" access="public" mangled="_ZN14git_index_timeC1Ev *INTERNAL* " demangled="git_index_time::git_index_time()" location="f8:52" file="f8" line="52" inline="1"/>
  <PointerType id="_863" type="_555" size="32" align="32"/>
  <PointerType id="_864" type="_828" size="32" align="32"/>
  <ArrayType id="_865" min="0" max="1u" type="_677" size="64" align="32"/>
  <Field id="_866" name="__size" type="_1106" offset="0" context="_166" access="public" location="f15:108" file="f15" line="108"/>
  <Field id="_867" name="__align" type="_91" offset="0" context="_166" access="public" location="f15:109" file="f15" line="109"/>
  <Destructor id="_868" name="._6" artificial="1" throw="" context="_166" access="public" mangled="_ZN19pthread_mutexattr_tD1Ev *INTERNAL* " demangled="pthread_mutexattr_t::~pthread_mutexattr_t()" location="f15:110" file="f15" line="110" endline="110" inline="1">
  </Destructor>
  <OperatorMethod id="_869" name="=" returns="_1107" artificial="1" throw="" context="_166" access="public" mangled="_ZN19pthread_mutexattr_taSERKS_" demangled="pthread_mutexattr_t::operator=(pthread_mutexattr_t const&amp;)" location="f15:110" file="f15" line="110" endline="110" inline="1">
    <Argument type="_1108" location="f15:107" file="f15" line="107"/>
  </OperatorMethod>
  <Constructor id="_870" name="._6" artificial="1" throw="" context="_166" access="public" mangled="_ZN19pthread_mutexattr_tC1ERKS_ *INTERNAL* " demangled="pthread_mutexattr_t::pthread_mutexattr_t(pthread_mutexattr_t const&amp;)" location="f15:110" file="f15" line="110" endline="110" inline="1">
    <Argument type="_1108" location="f15:107" file="f15" line="107"/>
  </Constructor>
  <Constructor id="_871" name="._6" artificial="1" throw="" context="_166" access="public" mangled="_ZN19pthread_mutexattr_tC1Ev *INTERNAL* " demangled="pthread_mutexattr_t::pthread_mutexattr_t()" location="f15:110" file="f15" line="110" inline="1"/>
  <PointerType id="_872" type="_621" size="32" align="32"/>
  <Field id="_873" name="fds_bits" type="_1109" offset="0" context="_175" access="public" location="f14:72" file="f14" line="72"/>
  <Destructor id="_874" name="._2" artificial="1" throw="" context="_175" access="public" mangled="_ZN6fd_setD1Ev *INTERNAL* " demangled="fd_set::~fd_set()" location="f14:78" file="f14" line="78" endline="78" inline="1">
  </Destructor>
  <OperatorMethod id="_875" name="=" returns="_1110" artificial="1" throw="" context="_175" access="public" mangled="_ZN6fd_setaSERKS_" demangled="fd_set::operator=(fd_set const&amp;)" location="f14:78" file="f14" line="78" endline="78" inline="1">
    <Argument type="_1111" location="f14:68" file="f14" line="68"/>
  </OperatorMethod>
  <Constructor id="_876" name="._2" artificial="1" throw="" context="_175" access="public" mangled="_ZN6fd_setC1ERKS_ *INTERNAL* " demangled="fd_set::fd_set(fd_set const&amp;)" location="f14:78" file="f14" line="78" endline="78" inline="1">
    <Argument type="_1111" location="f14:68" file="f14" line="68"/>
  </Constructor>
  <Constructor id="_877" name="._2" artificial="1" throw="" context="_175" access="public" mangled="_ZN6fd_setC1Ev *INTERNAL* " demangled="fd_set::fd_set()" location="f14:78" file="f14" line="78" inline="1"/>
  <PointerType id="_878" type="_83c" size="32" align="32"/>
  <Field id="_879" name="__size" type="_1106" offset="0" context="_183" access="public" location="f15:134" file="f15" line="134"/>
  <Field id="_880" name="__align" type="_91" offset="0" context="_183" access="public" location="f15:135" file="f15" line="135"/>
  <Destructor id="_881" name="._9" artificial="1" throw="" context="_183" access="public" mangled="_ZN18pthread_condattr_tD1Ev *INTERNAL* " demangled="pthread_condattr_t::~pthread_condattr_t()" location="f15:136" file="f15" line="136" endline="136" inline="1">
  </Destructor>
  <OperatorMethod id="_882" name="=" returns="_1113" artificial="1" throw="" context="_183" access="public" mangled="_ZN18pthread_condattr_taSERKS_" demangled="pthread_condattr_t::operator=(pthread_condattr_t const&amp;)" location="f15:136" file="f15" line="136" endline="136" inline="1">
    <Argument type="_1114" location="f15:133" file="f15" line="133"/>
  </OperatorMethod>
  <Constructor id="_883" name="._9" artificial="1" throw="" context="_183" access="public" mangled="_ZN18pthread_condattr_tC1ERKS_ *INTERNAL* " demangled="pthread_condattr_t::pthread_condattr_t(pthread_condattr_t const&amp;)" location="f15:136" file="f15" line="136" endline="136" inline="1">
    <Argument type="_1114" location="f15:133" file="f15" line="133"/>
  </Constructor>
  <Constructor id="_884" name="._9" artificial="1" throw="" context="_183" access="public" mangled="_ZN18pthread_condattr_tC1Ev *INTERNAL* " demangled="pthread_condattr_t::pthread_condattr_t()" location="f15:136" file="f15" line="136" inline="1"/>
  <PointerType id="_885" type="_421" size="32" align="32"/>
  <Field id="_886" name="__locales" type="_1115" offset="0" context="_185" access="public" location="f25:31" file="f25" line="31"/>
  <Field id="_887" name="__ctype_b" type="_1116" offset="416" context="_185" access="public" location="f25:34" file="f25" line="34"/>
  <Field id="_888" name="__ctype_tolower" type="_1117" offset="448" context="_185" access="public" location="f25:35" file="f25" line="35"/>
  <Field id="_889" name="__ctype_toupper" type="_1117" offset="480" context="_185" access="public" location="f25:36" file="f25" line="36"/>
  <Field id="_890" name="__names" type="_1118" offset="512" context="_185" access="public" location="f25:39" file="f25" line="39"/>
  <Destructor id="_891" name="__locale_struct" artificial="1" throw="" context="_185" access="public" mangled="_ZN15__locale_structD1Ev *INTERNAL* " demangled="__locale_struct::~__locale_struct()" location="f25:29" file="f25" line="29" endline="29" inline="1">
  </Destructor>
  <OperatorMethod id="_892" name="=" returns="_1119" artificial="1" throw="" context="_185" access="public" mangled="_ZN15__locale_structaSERKS_" demangled="__locale_struct::operator=(__locale_struct const&amp;)" location="f25:29" file="f25" line="29" endline="29" inline="1">
    <Argument type="_1120" location="f25:29" file="f25" line="29"/>
  </OperatorMethod>
  <Constructor id="_893" name="__locale_struct" artificial="1" throw="" context="_185" access="public" mangled="_ZN15__locale_structC1ERKS_ *INTERNAL* " demangled="__locale_struct::__locale_struct(__locale_struct const&amp;)" location="f25:29" file="f25" line="29" endline="29" inline="1">
    <Argument type="_1120" location="f25:29" file="f25" line="29"/>
  </Constructor>
  <Constructor id="_894" name="__locale_struct" artificial="1" throw="" context="_185" access="public" mangled="_ZN15__locale_structC1Ev *INTERNAL* " demangled="__locale_struct::__locale_struct()" location="f25:29" file="f25" line="29" inline="1"/>
  <Field id="_895" name="ctime" type="_136" offset="0" context="_186" access="public" location="f8:56" file="f8" line="56"/>
  <Field id="_896" name="mtime" type="_136" offset="64" context="_186" access="public" location="f8:57" file="f8" line="57"/>
  <Field id="_897" name="dev" type="_70" offset="128" context="_186" access="public" location="f8:59" file="f8" line="59"/>
  <Field id="_898" name="ino" type="_70" offset="160" context="_186" access="public" location="f8:60" file="f8" line="60"/>
  <Field id="_899" name="mode" type="_70" offset="192" context="_186" access="public" location="f8:61" file="f8" line="61"/>
  <Field id="_900" name="uid" type="_70" offset="224" context="_186" access="public" location="f8:62" file="f8" line="62"/>
  <Field id="_901" name="gid" type="_70" offset="256" context="_186" access="public" location="f8:63" file="f8" line="63"/>
  <Field id="_902" name="file_size" type="_655" offset="288" context="_186" access="public" location="f8:64" file="f8" line="64"/>
  <Field id="_903" name="oid" type="_621" offset="352" context="_186" access="public" location="f8:66" file="f8" line="66"/>
  <Field id="_904" name="flags" type="_173" offset="512" context="_186" access="public" location="f8:68" file="f8" line="68"/>
  <Field id="_905" name="flags_extended" type="_173" offset="528" context="_186" access="public" location="f8:69" file="f8" line="69"/>
  <Field id="_906" name="path" type="_677" offset="544" context="_186" access="public" location="f8:71" file="f8" line="71"/>
  <Destructor id="_907" name="git_index_entry" artificial="1" throw="" context="_186" access="public" mangled="_ZN15git_index_entryD1Ev *INTERNAL* " demangled="git_index_entry::~git_index_entry()" location="f8:55" file="f8" line="55" endline="55" inline="1">
  </Destructor>
  <OperatorMethod id="_908" name="=" returns="_1121" artificial="1" throw="" context="_186" access="public" mangled="_ZN15git_index_entryaSERKS_" demangled="git_index_entry::operator=(git_index_entry const&amp;)" location="f8:55" file="f8" line="55" endline="55" inline="1">
    <Argument type="_1122" location="f8:55" file="f8" line="55"/>
  </OperatorMethod>
  <Constructor id="_909" name="git_index_entry" artificial="1" throw="" context="_186" access="public" mangled="_ZN15git_index_entryC1ERKS_ *INTERNAL* " demangled="git_index_entry::git_index_entry(git_index_entry const&amp;)" location="f8:55" file="f8" line="55" endline="55" inline="1">
    <Argument type="_1122" location="f8:55" file="f8" line="55"/>
  </Constructor>
  <Constructor id="_910" name="git_index_entry" artificial="1" throw="" context="_186" access="public" mangled="_ZN15git_index_entryC1Ev *INTERNAL* " demangled="git_index_entry::git_index_entry()" location="f8:55" file="f8" line="55" inline="1"/>
  <CvQualifiedType id="_856r" type="_856" restrict="1"/>
  <PointerType id="_912" type="_347" size="32" align="32"/>
  <PointerType id="_913" type="_128" size="32" align="32"/>
  <PointerType id="_915" type="_551" size="32" align="32"/>
  <PointerType id="_916" type="_707" size="32" align="32"/>
  <CvQualifiedType id="_878r" type="_878" restrict="1"/>
  <CvQualifiedType id="_91v" type="_91" volatile="1"/>
  <Field id="_919" name="text" type="_91" offset="0" context="_229" access="public" location="f4:113" file="f4" line="113"/>
  <Field id="_920" name="time" type="_746" offset="32" context="_229" access="public" location="f4:114" file="f4" line="114"/>
  <Field id="_921" name="xflags" type="_91" offset="64" context="_229" access="public" location="f4:115" file="f4" line="115"/>
  <Field id="_922" name="os" type="_91" offset="96" context="_229" access="public" location="f4:116" file="f4" line="116"/>
  <Field id="_923" name="extra" type="_846" offset="128" context="_229" access="public" location="f4:117" file="f4" line="117"/>
  <Field id="_924" name="extra_len" type="_381" offset="160" context="_229" access="public" location="f4:118" file="f4" line="118"/>
  <Field id="_925" name="extra_max" type="_381" offset="192" context="_229" access="public" location="f4:119" file="f4" line="119"/>
  <Field id="_926" name="name" type="_846" offset="224" context="_229" access="public" location="f4:120" file="f4" line="120"/>
  <Field id="_927" name="name_max" type="_381" offset="256" context="_229" access="public" location="f4:121" file="f4" line="121"/>
  <Field id="_928" name="comment" type="_846" offset="288" context="_229" access="public" location="f4:122" file="f4" line="122"/>
  <Field id="_929" name="comm_max" type="_381" offset="320" context="_229" access="public" location="f4:123" file="f4" line="123"/>
  <Field id="_930" name="hcrc" type="_91" offset="352" context="_229" access="public" location="f4:124" file="f4" line="124"/>
  <Field id="_931" name="done" type="_91" offset="384" context="_229" access="public" location="f4:125" file="f4" line="125"/>
  <Destructor id="_932" name="gz_header_s" artificial="1" throw="" context="_229" access="public" mangled="_ZN11gz_header_sD1Ev *INTERNAL* " demangled="gz_header_s::~gz_header_s()" location="f4:112" file="f4" line="112" endline="112" inline="1">
  </Destructor>
  <OperatorMethod id="_933" name="=" returns="_1123" artificial="1" throw="" context="_229" access="public" mangled="_ZN11gz_header_saSERKS_" demangled="gz_header_s::operator=(gz_header_s const&amp;)" location="f4:112" file="f4" line="112" endline="112" inline="1">
    <Argument type="_1124" location="f4:112" file="f4" line="112"/>
  </OperatorMethod>
  <Constructor id="_934" name="gz_header_s" artificial="1" throw="" context="_229" access="public" mangled="_ZN11gz_header_sC1ERKS_ *INTERNAL* " demangled="gz_header_s::gz_header_s(gz_header_s const&amp;)" location="f4:112" file="f4" line="112" endline="112" inline="1">
    <Argument type="_1124" location="f4:112" file="f4" line="112"/>
  </Constructor>
  <Constructor id="_935" name="gz_header_s" artificial="1" throw="" context="_229" access="public" mangled="_ZN11gz_header_sC1Ev *INTERNAL* " demangled="gz_header_s::gz_header_s()" location="f4:112" file="f4" line="112" inline="1"/>
  <PointerType id="_936" type="_13c" size="32" align="32"/>
  <PointerType id="_937" type="_173" size="32" align="32"/>
  <Field id="_939" name="__data" type="_942" offset="0" context="_246" access="public" location="f15:127" file="f15" line="127"/>
  <Field id="_940" name="__size" type="_1126" offset="0" context="_246" access="public" location="f15:128" file="f15" line="128"/>
  <Field id="_941" name="__align" type="_59" offset="0" context="_246" access="public" location="f15:129" file="f15" line="129"/>
  <Struct id="_942" context="_246" access="public" mangled="N14pthread_cond_t3._8E" demangled="pthread_cond_t::._8" location="f15:118" file="f15" line="118" artificial="1" size="352" align="32" members="_1127 _1128 _1129 _1130 _1131 _1132 _1133 _1134 _1135 _1136 _1137 _1138 " bases=""/>
  <Destructor id="_943" name="._7" artificial="1" throw="" context="_246" access="public" mangled="_ZN14pthread_cond_tD1Ev *INTERNAL* " demangled="pthread_cond_t::~pthread_cond_t()" location="f15:130" file="f15" line="130" endline="130" inline="1">
  </Destructor>
  <OperatorMethod id="_944" name="=" returns="_1139" artificial="1" throw="" context="_246" access="public" mangled="_ZN14pthread_cond_taSERKS_" demangled="pthread_cond_t::operator=(pthread_cond_t const&amp;)" location="f15:130" file="f15" line="130" endline="130" inline="1">
    <Argument type="_1140" location="f15:116" file="f15" line="116"/>
  </OperatorMethod>
  <Constructor id="_945" name="._7" artificial="1" throw="" context="_246" access="public" mangled="_ZN14pthread_cond_tC1ERKS_ *INTERNAL* " demangled="pthread_cond_t::pthread_cond_t(pthread_cond_t const&amp;)" location="f15:130" file="f15" line="130" endline="130" inline="1">
    <Argument type="_1140" location="f15:116" file="f15" line="116"/>
  </Constructor>
  <Constructor id="_946" name="._7" artificial="1" throw="" context="_246" access="public" mangled="_ZN14pthread_cond_tC1Ev *INTERNAL* " demangled="pthread_cond_t::pthread_cond_t()" location="f15:130" file="f15" line="130" inline="1"/>
  <PointerType id="_947" type="_539" size="32" align="32"/>
  <PointerType id="_948" type="_356" size="32" align="32"/>
  <PointerType id="_949" type="_948" size="32" align="32"/>
  <Field id="_950" name="__size" type="_1141" offset="0" context="_252" access="public" location="f15:208" file="f15" line="208"/>
  <Field id="_951" name="__align" type="_16" offset="0" context="_252" access="public" location="f15:209" file="f15" line="209"/>
  <Destructor id="_952" name="._13" artificial="1" throw="" context="_252" access="public" mangled="_ZN17pthread_barrier_tD1Ev *INTERNAL* " demangled="pthread_barrier_t::~pthread_barrier_t()" location="f15:210" file="f15" line="210" endline="210" inline="1">
  </Destructor>
  <OperatorMethod id="_953" name="=" returns="_1142" artificial="1" throw="" context="_252" access="public" mangled="_ZN17pthread_barrier_taSERKS_" demangled="pthread_barrier_t::operator=(pthread_barrier_t const&amp;)" location="f15:210" file="f15" line="210" endline="210" inline="1">
    <Argument type="_1143" location="f15:207" file="f15" line="207"/>
  </OperatorMethod>
  <Constructor id="_954" name="._13" artificial="1" throw="" context="_252" access="public" mangled="_ZN17pthread_barrier_tC1ERKS_ *INTERNAL* " demangled="pthread_barrier_t::pthread_barrier_t(pthread_barrier_t const&amp;)" location="f15:210" file="f15" line="210" endline="210" inline="1">
    <Argument type="_1143" location="f15:207" file="f15" line="207"/>
  </Constructor>
  <Constructor id="_955" name="._13" artificial="1" throw="" context="_252" access="public" mangled="_ZN17pthread_barrier_tC1Ev *INTERNAL* " demangled="pthread_barrier_t::pthread_barrier_t()" location="f15:210" file="f15" line="210" inline="1"/>
  <PointerType id="_956" type="_91" size="32" align="32"/>
  <PointerType id="_957" type="_829" size="32" align="32"/>
  <CvQualifiedType id="_198r" type="_198" restrict="1"/>
  <CvQualifiedType id="_200r" type="_200" restrict="1"/>
  <Field id="_960" name="__val" type="_1144" offset="0" context="_266" access="public" location="f12:144" file="f12" line="144"/>
  <Destructor id="_961" name="._0" artificial="1" throw="" context="_266" access="public" mangled="_ZN8__fsid_tD1Ev *INTERNAL* " demangled="__fsid_t::~__fsid_t()" location="f12:144" file="f12" line="144" endline="144" inline="1">
  </Destructor>
  <OperatorMethod id="_962" name="=" returns="_1145" artificial="1" throw="" context="_266" access="public" mangled="_ZN8__fsid_taSERKS_" demangled="__fsid_t::operator=(__fsid_t const&amp;)" location="f12:144" file="f12" line="144" endline="144" inline="1">
    <Argument type="_1146" location="f12:144" file="f12" line="144"/>
  </OperatorMethod>
  <Constructor id="_963" name="._0" artificial="1" throw="" context="_266" access="public" mangled="_ZN8__fsid_tC1ERKS_ *INTERNAL* " demangled="__fsid_t::__fsid_t(__fsid_t const&amp;)" location="f12:144" file="f12" line="144" endline="144" inline="1">
    <Argument type="_1146" location="f12:144" file="f12" line="144"/>
  </Constructor>
  <Constructor id="_964" name="._0" artificial="1" throw="" context="_266" access="public" mangled="_ZN8__fsid_tC1Ev *INTERNAL* " demangled="__fsid_t::__fsid_t()" location="f12:144" file="f12" line="144" inline="1"/>
  <PointerType id="_965" type="_361" size="32" align="32"/>
  <PointerType id="_966" type="_347c" size="32" align="32"/>
  <PointerType id="_967" type="_138c" size="32" align="32"/>
  <PointerType id="_968" type="_796" size="32" align="32"/>
  <PointerType id="_969" type="_797" size="32" align="32"/>
  <PointerType id="_970" type="_187c" size="32" align="32"/>
  <PointerType id="_971" type="_187" size="32" align="32"/>
  <Field id="_972" name="tv_sec" type="_474" offset="0" context="_347" access="public" location="f0:122" file="f0" line="122"/>
  <Field id="_973" name="tv_nsec" type="_16" offset="32" context="_347" access="public" location="f0:123" file="f0" line="123"/>
  <Destructor id="_974" name="timespec" artificial="1" throw="" context="_347" access="public" mangled="_ZN8timespecD1Ev *INTERNAL* " demangled="timespec::~timespec()" location="f0:121" file="f0" line="121" endline="121" inline="1">
  </Destructor>
  <OperatorMethod id="_975" name="=" returns="_1150" artificial="1" throw="" context="_347" access="public" mangled="_ZN8timespecaSERKS_" demangled="timespec::operator=(timespec const&amp;)" location="f0:121" file="f0" line="121" endline="121" inline="1">
    <Argument type="_1151" location="f0:121" file="f0" line="121"/>
  </OperatorMethod>
  <Constructor id="_976" name="timespec" artificial="1" throw="" context="_347" access="public" mangled="_ZN8timespecC1ERKS_ *INTERNAL* " demangled="timespec::timespec(timespec const&amp;)" location="f0:121" file="f0" line="121" endline="121" inline="1">
    <Argument type="_1151" location="f0:121" file="f0" line="121"/>
  </Constructor>
  <Constructor id="_977" name="timespec" artificial="1" throw="" context="_347" access="public" mangled="_ZN8timespecC1Ev *INTERNAL* " demangled="timespec::timespec()" location="f0:121" file="f0" line="121" inline="1"/>
  <PointerType id="_978" type="_175" size="32" align="32"/>
  <CvQualifiedType id="_978r" type="_978" restrict="1"/>
  <CvQualifiedType id="_966r" type="_966" restrict="1"/>
  <PointerType id="_981" type="_54c" size="32" align="32"/>
  <CvQualifiedType id="_981r" type="_981" restrict="1"/>
  <PointerType id="_983" type="_855" size="32" align="32"/>
  <Field id="_984" name="__size" type="_1106" offset="0" context="_394" access="public" location="f15:214" file="f15" line="214"/>
  <Field id="_985" name="__align" type="_91" offset="0" context="_394" access="public" location="f15:215" file="f15" line="215"/>
  <Destructor id="_986" name="._14" artificial="1" throw="" context="_394" access="public" mangled="_ZN21pthread_barrierattr_tD1Ev *INTERNAL* " demangled="pthread_barrierattr_t::~pthread_barrierattr_t()" location="f15:216" file="f15" line="216" endline="216" inline="1">
  </Destructor>
  <OperatorMethod id="_987" name="=" returns="_1153" artificial="1" throw="" context="_394" access="public" mangled="_ZN21pthread_barrierattr_taSERKS_" demangled="pthread_barrierattr_t::operator=(pthread_barrierattr_t const&amp;)" location="f15:216" file="f15" line="216" endline="216" inline="1">
    <Argument type="_1154" location="f15:213" file="f15" line="213"/>
  </OperatorMethod>
  <Constructor id="_988" name="._14" artificial="1" throw="" context="_394" access="public" mangled="_ZN21pthread_barrierattr_tC1ERKS_ *INTERNAL* " demangled="pthread_barrierattr_t::pthread_barrierattr_t(pthread_barrierattr_t const&amp;)" location="f15:216" file="f15" line="216" endline="216" inline="1">
    <Argument type="_1154" location="f15:213" file="f15" line="213"/>
  </Constructor>
  <Constructor id="_989" name="._14" artificial="1" throw="" context="_394" access="public" mangled="_ZN21pthread_barrierattr_tC1Ev *INTERNAL* " demangled="pthread_barrierattr_t::pthread_barrierattr_t()" location="f15:216" file="f15" line="216" inline="1"/>
  <CvQualifiedType id="_936r" type="_936" restrict="1"/>
  <PointerType id="_991" type="_284c" size="32" align="32"/>
  <PointerType id="_992" type="_851" size="32" align="32"/>
  <Field id="_993" name="__size" type="_1156" offset="0" context="_428" access="public" location="f15:193" file="f15" line="193"/>
  <Field id="_994" name="__align" type="_16" offset="0" context="_428" access="public" location="f15:194" file="f15" line="194"/>
  <Destructor id="_995" name="._12" artificial="1" throw="" context="_428" access="public" mangled="_ZN20pthread_rwlockattr_tD1Ev *INTERNAL* " demangled="pthread_rwlockattr_t::~pthread_rwlockattr_t()" location="f15:195" file="f15" line="195" endline="195" inline="1">
  </Destructor>
  <OperatorMethod id="_996" name="=" returns="_1157" artificial="1" throw="" context="_428" access="public" mangled="_ZN20pthread_rwlockattr_taSERKS_" demangled="pthread_rwlockattr_t::operator=(pthread_rwlockattr_t const&amp;)" location="f15:195" file="f15" line="195" endline="195" inline="1">
    <Argument type="_1158" location="f15:192" file="f15" line="192"/>
  </OperatorMethod>
  <Constructor id="_997" name="._12" artificial="1" throw="" context="_428" access="public" mangled="_ZN20pthread_rwlockattr_tC1ERKS_ *INTERNAL* " demangled="pthread_rwlockattr_t::pthread_rwlockattr_t(pthread_rwlockattr_t const&amp;)" location="f15:195" file="f15" line="195" endline="195" inline="1">
    <Argument type="_1158" location="f15:192" file="f15" line="192"/>
  </Constructor>
  <Constructor id="_998" name="._12" artificial="1" throw="" context="_428" access="public" mangled="_ZN20pthread_rwlockattr_tC1Ev *INTERNAL* " demangled="pthread_rwlockattr_t::pthread_rwlockattr_t()" location="f15:195" file="f15" line="195" inline="1"/>
  <Field id="_999" name="next_in" type="_846" offset="0" context="_439" access="public" location="f4:86" file="f4" line="86"/>
  <Field id="_1000" name="avail_in" type="_381" offset="32" context="_439" access="public" location="f4:87" file="f4" line="87"/>
  <Field id="_1001" name="total_in" type="_746" offset="64" context="_439" access="public" location="f4:88" file="f4" line="88"/>
  <Field id="_1002" name="next_out" type="_846" offset="96" context="_439" access="public" location="f4:90" file="f4" line="90"/>
  <Field id="_1003" name="avail_out" type="_381" offset="128" context="_439" access="public" location="f4:91" file="f4" line="91"/>
  <Field id="_1004" name="total_out" type="_746" offset="160" context="_439" access="public" location="f4:92" file="f4" line="92"/>
  <Field id="_1005" name="msg" type="_677" offset="192" context="_439" access="public" location="f4:94" file="f4" line="94"/>
  <Field id="_1006" name="state" type="_1159" offset="224" context="_439" access="public" location="f4:95" file="f4" line="95"/>
  <Field id="_1007" name="zalloc" type="_664" offset="256" context="_439" access="public" location="f4:97" file="f4" line="97"/>
  <Field id="_1008" name="zfree" type="_53" offset="288" context="_439" access="public" location="f4:98" file="f4" line="98"/>
  <Field id="_1009" name="opaque" type="_201" offset="320" context="_439" access="public" location="f4:99" file="f4" line="99"/>
  <Field id="_1010" name="data_type" type="_91" offset="352" context="_439" access="public" location="f4:101" file="f4" line="101"/>
  <Field id="_1011" name="adler" type="_746" offset="384" context="_439" access="public" location="f4:102" file="f4" line="102"/>
  <Field id="_1012" name="reserved" type="_746" offset="416" context="_439" access="public" location="f4:103" file="f4" line="103"/>
  <Destructor id="_1013" name="z_stream_s" artificial="1" throw="" context="_439" access="public" mangled="_ZN10z_stream_sD1Ev *INTERNAL* " demangled="z_stream_s::~z_stream_s()" location="f4:85" file="f4" line="85" endline="85" inline="1">
  </Destructor>
  <OperatorMethod id="_1014" name="=" returns="_1160" artificial="1" throw="" context="_439" access="public" mangled="_ZN10z_stream_saSERKS_" demangled="z_stream_s::operator=(z_stream_s const&amp;)" location="f4:85" file="f4" line="85" endline="85" inline="1">
    <Argument type="_1161" location="f4:85" file="f4" line="85"/>
  </OperatorMethod>
  <Constructor id="_1015" name="z_stream_s" artificial="1" throw="" context="_439" access="public" mangled="_ZN10z_stream_sC1ERKS_ *INTERNAL* " demangled="z_stream_s::z_stream_s(z_stream_s const&amp;)" location="f4:85" file="f4" line="85" endline="85" inline="1">
    <Argument type="_1161" location="f4:85" file="f4" line="85"/>
  </Constructor>
  <Constructor id="_1016" name="z_stream_s" artificial="1" throw="" context="_439" access="public" mangled="_ZN10z_stream_sC1Ev *INTERNAL* " demangled="z_stream_s::z_stream_s()" location="f4:85" file="f4" line="85" inline="1"/>
  <PointerType id="_1017" type="_110" size="32" align="32"/>
  <PointerType id="_1018" type="_913" size="32" align="32"/>
  <Field id="_1019" name="__size" type="_1162" offset="0" context="_475" access="public" location="f15:55" file="f15" line="55"/>
  <Field id="_1020" name="__align" type="_16" offset="0" context="_475" access="public" location="f15:56" file="f15" line="56"/>
  <Destructor id="_1021" name="._3" artificial="1" throw="" context="_475" access="public" mangled="_ZN14pthread_attr_tD1Ev *INTERNAL* " demangled="pthread_attr_t::~pthread_attr_t()" location="f15:57" file="f15" line="57" endline="57" inline="1">
  </Destructor>
  <OperatorMethod id="_1022" name="=" returns="_1163" artificial="1" throw="" context="_475" access="public" mangled="_ZN14pthread_attr_taSERKS_" demangled="pthread_attr_t::operator=(pthread_attr_t const&amp;)" location="f15:57" file="f15" line="57" endline="57" inline="1">
    <Argument type="_1164" location="f15:54" file="f15" line="54"/>
  </OperatorMethod>
  <Constructor id="_1023" name="._3" artificial="1" throw="" context="_475" access="public" mangled="_ZN14pthread_attr_tC1ERKS_ *INTERNAL* " demangled="pthread_attr_t::pthread_attr_t(pthread_attr_t const&amp;)" location="f15:57" file="f15" line="57" endline="57" inline="1">
    <Argument type="_1164" location="f15:54" file="f15" line="54"/>
  </Constructor>
  <Constructor id="_1024" name="._3" artificial="1" throw="" context="_475" access="public" mangled="_ZN14pthread_attr_tC1Ev *INTERNAL* " demangled="pthread_attr_t::pthread_attr_t()" location="f15:57" file="f15" line="57" inline="1"/>
  <Field id="_1025" name="__data" type="_1028" offset="0" context="_476" access="public" location="f15:101" file="f15" line="101"/>
  <Field id="_1026" name="__size" type="_1165" offset="0" context="_476" access="public" location="f15:102" file="f15" line="102"/>
  <Field id="_1027" name="__align" type="_16" offset="0" context="_476" access="public" location="f15:103" file="f15" line="103"/>
  <Struct id="_1028" name="__pthread_mutex_s" context="_476" access="public" mangled="N15pthread_mutex_t17__pthread_mutex_sE" demangled="pthread_mutex_t::__pthread_mutex_s" location="f15:79" file="f15" line="79" artificial="1" size="192" align="32" members="_1166 _1167 _1168 _1169 _1170 _1171 _1172 _1173 _1174 _1175 _1176 " bases=""/>
  <Destructor id="_1029" name="._4" artificial="1" throw="" context="_476" access="public" mangled="_ZN15pthread_mutex_tD1Ev *INTERNAL* " demangled="pthread_mutex_t::~pthread_mutex_t()" location="f15:104" file="f15" line="104" endline="104" inline="1">
  </Destructor>
  <OperatorMethod id="_1030" name="=" returns="_1177" artificial="1" throw="" context="_476" access="public" mangled="_ZN15pthread_mutex_taSERKS_" demangled="pthread_mutex_t::operator=(pthread_mutex_t const&amp;)" location="f15:104" file="f15" line="104" endline="104" inline="1">
    <Argument type="_1178" location="f15:77" file="f15" line="77"/>
  </OperatorMethod>
  <Constructor id="_1031" name="._4" artificial="1" throw="" context="_476" access="public" mangled="_ZN15pthread_mutex_tC1ERKS_ *INTERNAL* " demangled="pthread_mutex_t::pthread_mutex_t(pthread_mutex_t const&amp;)" location="f15:104" file="f15" line="104" endline="104" inline="1">
    <Argument type="_1178" location="f15:77" file="f15" line="77"/>
  </Constructor>
  <Constructor id="_1032" name="._4" artificial="1" throw="" context="_476" access="public" mangled="_ZN15pthread_mutex_tC1Ev *INTERNAL* " demangled="pthread_mutex_t::pthread_mutex_t()" location="f15:104" file="f15" line="104" inline="1"/>
  <PointerType id="_1033" type="_551c" size="32" align="32"/>
  <PointerType id="_1034" type="_654c" size="32" align="32"/>
  <Field id="_1035" name="name" type="_677" offset="0" context="_550" access="public" location="f17:133" file="f17" line="133"/>
  <Field id="_1036" name="email" type="_677" offset="32" context="_550" access="public" location="f17:134" file="f17" line="134"/>
  <Field id="_1037" name="when" type="_695" offset="64" context="_550" access="public" location="f17:135" file="f17" line="135"/>
  <Destructor id="_1038" name="git_signature" artificial="1" throw="" context="_550" access="public" mangled="_ZN13git_signatureD1Ev *INTERNAL* " demangled="git_signature::~git_signature()" location="f17:132" file="f17" line="132" endline="132" inline="1">
  </Destructor>
  <OperatorMethod id="_1039" name="=" returns="_1181" artificial="1" throw="" context="_550" access="public" mangled="_ZN13git_signatureaSERKS_" demangled="git_signature::operator=(git_signature const&amp;)" location="f17:132" file="f17" line="132" endline="132" inline="1">
    <Argument type="_1182" location="f17:132" file="f17" line="132"/>
  </OperatorMethod>
  <Constructor id="_1040" name="git_signature" artificial="1" throw="" context="_550" access="public" mangled="_ZN13git_signatureC1ERKS_ *INTERNAL* " demangled="git_signature::git_signature(git_signature const&amp;)" location="f17:132" file="f17" line="132" endline="132" inline="1">
    <Argument type="_1182" location="f17:132" file="f17" line="132"/>
  </Constructor>
  <Constructor id="_1041" name="git_signature" artificial="1" throw="" context="_550" access="public" mangled="_ZN13git_signatureC1Ev *INTERNAL* " demangled="git_signature::git_signature()" location="f17:132" file="f17" line="132" inline="1"/>
  <PointerType id="_1042" type="_113" size="32" align="32"/>
  <CvQualifiedType id="_1042r" type="_1042" restrict="1"/>
  <PointerType id="_1044" type="_239" size="32" align="32"/>
  <CvQualifiedType id="_1044r" type="_1044" restrict="1"/>
  <Field id="_1046" name="dummy" type="_91" offset="0" context="_598" access="public" location="f4:1476" file="f4" line="1476"/>
  <Destructor id="_1047" name="internal_state" artificial="1" throw="" context="_598" access="public" mangled="_ZN14internal_stateD1Ev *INTERNAL* " demangled="internal_state::~internal_state()" location="f4:1476" file="f4" line="1476" endline="1476" inline="1">
  </Destructor>
  <OperatorMethod id="_1048" name="=" returns="_1183" artificial="1" throw="" context="_598" access="public" mangled="_ZN14internal_stateaSERKS_" demangled="internal_state::operator=(internal_state const&amp;)" location="f4:1476" file="f4" line="1476" endline="1476" inline="1">
    <Argument type="_1184" location="f4:1476" file="f4" line="1476"/>
  </OperatorMethod>
  <Constructor id="_1049" name="internal_state" artificial="1" throw="" context="_598" access="public" mangled="_ZN14internal_stateC1ERKS_ *INTERNAL* " demangled="internal_state::internal_state(internal_state const&amp;)" location="f4:1476" file="f4" line="1476" endline="1476" inline="1">
    <Argument type="_1184" location="f4:1476" file="f4" line="1476"/>
  </Constructor>
  <Constructor id="_1050" name="internal_state" artificial="1" throw="" context="_598" access="public" mangled="_ZN14internal_stateC1Ev *INTERNAL* " demangled="internal_state::internal_state()" location="f4:1476" file="f4" line="1476" inline="1"/>
  <Field id="_1051" name="id" type="_1185" offset="0" context="_621" access="public" location="f23:49" file="f23" line="49"/>
  <Destructor id="_1052" name="._20" artificial="1" throw="" context="_621" access="public" mangled="_ZN7git_oidD1Ev *INTERNAL* " demangled="git_oid::~git_oid()" location="f23:50" file="f23" line="50" endline="50" inline="1">
  </Destructor>
  <OperatorMethod id="_1053" name="=" returns="_1186" artificial="1" throw="" context="_621" access="public" mangled="_ZN7git_oidaSERKS_" demangled="git_oid::operator=(git_oid const&amp;)" location="f23:50" file="f23" line="50" endline="50" inline="1">
    <Argument type="_1187" location="f23:47" file="f23" line="47"/>
  </OperatorMethod>
  <Constructor id="_1054" name="._20" artificial="1" throw="" context="_621" access="public" mangled="_ZN7git_oidC1ERKS_ *INTERNAL* " demangled="git_oid::git_oid(git_oid const&amp;)" location="f23:50" file="f23" line="50" endline="50" inline="1">
    <Argument type="_1187" location="f23:47" file="f23" line="47"/>
  </Constructor>
  <Constructor id="_1055" name="._20" artificial="1" throw="" context="_621" access="public" mangled="_ZN7git_oidC1Ev *INTERNAL* " demangled="git_oid::git_oid()" location="f23:50" file="f23" line="50" inline="1"/>
  <PointerType id="_1056" type="_677" size="32" align="32"/>
  <PointerType id="_1057" type="_3c" size="32" align="32"/>
  <CvQualifiedType id="_1057r" type="_1057" restrict="1"/>
  <PointerType id="_1059" type="_3" size="32" align="32"/>
  <CvQualifiedType id="_1059r" type="_1059" restrict="1"/>
  <PointerType id="_1061" type="_61c" size="32" align="32"/>
  <Field id="_1063" name="data" type="_200" offset="0" context="_671" access="public" location="f11:109" file="f11" line="109"/>
  <Field id="_1064" name="len" type="_525" offset="32" context="_671" access="public" location="f11:110" file="f11" line="110"/>
  <Field id="_1065" name="type" type="_156" offset="64" context="_671" access="public" location="f11:111" file="f11" line="111"/>
  <Destructor id="_1066" name="._21" artificial="1" throw="" context="_671" access="public" mangled="_ZN10git_rawobjD1Ev *INTERNAL* " demangled="git_rawobj::~git_rawobj()" location="f11:112" file="f11" line="112" endline="112" inline="1">
  </Destructor>
  <OperatorMethod id="_1067" name="=" returns="_1190" artificial="1" throw="" context="_671" access="public" mangled="_ZN10git_rawobjaSERKS_" demangled="git_rawobj::operator=(git_rawobj const&amp;)" location="f11:112" file="f11" line="112" endline="112" inline="1">
    <Argument type="_1191" location="f11:108" file="f11" line="108"/>
  </OperatorMethod>
  <Constructor id="_1068" name="._21" artificial="1" throw="" context="_671" access="public" mangled="_ZN10git_rawobjC1ERKS_ *INTERNAL* " demangled="git_rawobj::git_rawobj(git_rawobj const&amp;)" location="f11:112" file="f11" line="112" endline="112" inline="1">
    <Argument type="_1191" location="f11:108" file="f11" line="108"/>
  </Constructor>
  <Constructor id="_1069" name="._21" artificial="1" throw="" context="_671" access="public" mangled="_ZN10git_rawobjC1Ev *INTERNAL* " demangled="git_rawobj::git_rawobj()" location="f11:112" file="f11" line="112" inline="1"/>
  <PointerType id="_1070" type="_83" size="32" align="32"/>
  <Field id="_1071" name="time" type="_83" offset="0" context="_694" access="public" location="f17:127" file="f17" line="127"/>
  <Field id="_1072" name="offset" type="_91" offset="32" context="_694" access="public" location="f17:128" file="f17" line="128"/>
  <Destructor id="_1073" name="git_time" artificial="1" throw="" context="_694" access="public" mangled="_ZN8git_timeD1Ev *INTERNAL* " demangled="git_time::~git_time()" location="f17:126" file="f17" line="126" endline="126" inline="1">
  </Destructor>
  <OperatorMethod id="_1074" name="=" returns="_1192" artificial="1" throw="" context="_694" access="public" mangled="_ZN8git_timeaSERKS_" demangled="git_time::operator=(git_time const&amp;)" location="f17:126" file="f17" line="126" endline="126" inline="1">
    <Argument type="_1193" location="f17:126" file="f17" line="126"/>
  </OperatorMethod>
  <Constructor id="_1075" name="git_time" artificial="1" throw="" context="_694" access="public" mangled="_ZN8git_timeC1ERKS_ *INTERNAL* " demangled="git_time::git_time(git_time const&amp;)" location="f17:126" file="f17" line="126" endline="126" inline="1">
    <Argument type="_1193" location="f17:126" file="f17" line="126"/>
  </Constructor>
  <Constructor id="_1076" name="git_time" artificial="1" throw="" context="_694" access="public" mangled="_ZN8git_timeC1Ev *INTERNAL* " demangled="git_time::git_time()" location="f17:126" file="f17" line="126" inline="1"/>
  <Field id="_1077" name="__data" type="_1080" offset="0" context="_698" access="public" location="f15:185" file="f15" line="185"/>
  <Field id="_1078" name="__size" type="_1194" offset="0" context="_698" access="public" location="f15:187" file="f15" line="187"/>
  <Field id="_1079" name="__align" type="_16" offset="0" context="_698" access="public" location="f15:188" file="f15" line="188"/>
  <Struct id="_1080" context="_698" access="public" mangled="N16pthread_rwlock_t4._11E" demangled="pthread_rwlock_t::._11" location="f15:171" file="f15" line="171" artificial="1" size="256" align="32" members="_1195 _1196 _1197 _1198 _1199 _1200 _1201 _1202 _1203 _1204 _1205 _1206 _1207 _1208 _1209 " bases=""/>
  <Destructor id="_1081" name="._10" artificial="1" throw="" context="_698" access="public" mangled="_ZN16pthread_rwlock_tD1Ev *INTERNAL* " demangled="pthread_rwlock_t::~pthread_rwlock_t()" location="f15:189" file="f15" line="189" endline="189" inline="1">
  </Destructor>
  <OperatorMethod id="_1082" name="=" returns="_1210" artificial="1" throw="" context="_698" access="public" mangled="_ZN16pthread_rwlock_taSERKS_" demangled="pthread_rwlock_t::operator=(pthread_rwlock_t const&amp;)" location="f15:189" file="f15" line="189" endline="189" inline="1">
    <Argument type="_1211" location="f15:151" file="f15" line="151"/>
  </OperatorMethod>
  <Constructor id="_1083" name="._10" artificial="1" throw="" context="_698" access="public" mangled="_ZN16pthread_rwlock_tC1ERKS_ *INTERNAL* " demangled="pthread_rwlock_t::pthread_rwlock_t(pthread_rwlock_t const&amp;)" location="f15:189" file="f15" line="189" endline="189" inline="1">
    <Argument type="_1211" location="f15:151" file="f15" line="151"/>
  </Constructor>
  <Constructor id="_1084" name="._10" artificial="1" throw="" context="_698" access="public" mangled="_ZN16pthread_rwlock_tC1Ev *INTERNAL* " demangled="pthread_rwlock_t::pthread_rwlock_t()" location="f15:189" file="f15" line="189" inline="1"/>
  <PointerType id="_1085" type="_11" size="32" align="32"/>
  <CvQualifiedType id="_1085r" type="_1085" restrict="1"/>
  <PointerType id="_1087" type="_541" size="32" align="32"/>
  <ReferenceType id="_1088" type="_3" size="32" align="32"/>
  <ReferenceType id="_1089" type="_3c" size="32" align="32"/>
  <ReferenceType id="_1091" type="_11" size="32" align="32"/>
  <ReferenceType id="_1092" type="_11c" size="32" align="32"/>
  <ReferenceType id="_1093" type="_13" size="32" align="32"/>
  <ReferenceType id="_1094" type="_13c" size="32" align="32"/>
  <ArrayType id="_1098" min="0" max="31u" type="_283" size="1024" align="32"/>
  <ReferenceType id="_1099" type="_54" size="32" align="32"/>
  <ReferenceType id="_1100" type="_54c" size="32" align="32"/>
  <PointerType id="_1101" type="_56" size="32" align="32"/>
  <ReferenceType id="_1102" type="_56" size="32" align="32"/>
  <ReferenceType id="_1103" type="_56c" size="32" align="32"/>
  <ReferenceType id="_1104" type="_136" size="32" align="32"/>
  <ReferenceType id="_1105" type="_136c" size="32" align="32"/>
  <ArrayType id="_1106" min="0" max="3u" type="_605" size="32" align="8"/>
  <ReferenceType id="_1107" type="_166" size="32" align="32"/>
  <ReferenceType id="_1108" type="_166c" size="32" align="32"/>
  <ArrayType id="_1109" min="0" max="31u" type="_616" size="1024" align="32"/>
  <ReferenceType id="_1110" type="_175" size="32" align="32"/>
  <ReferenceType id="_1111" type="_175c" size="32" align="32"/>
  <ReferenceType id="_1113" type="_183" size="32" align="32"/>
  <ReferenceType id="_1114" type="_183c" size="32" align="32"/>
  <ArrayType id="_1115" min="0" max="12u" type="_1218" size="416" align="32"/>
  <PointerType id="_1116" type="_173c" size="32" align="32"/>
  <PointerType id="_1117" type="_91c" size="32" align="32"/>
  <ArrayType id="_1118" min="0" max="12u" type="_795" size="416" align="32"/>
  <ReferenceType id="_1119" type="_185" size="32" align="32"/>
  <ReferenceType id="_1120" type="_185c" size="32" align="32"/>
  <ReferenceType id="_1121" type="_186" size="32" align="32"/>
  <ReferenceType id="_1122" type="_186c" size="32" align="32"/>
  <ReferenceType id="_1123" type="_229" size="32" align="32"/>
  <ReferenceType id="_1124" type="_229c" size="32" align="32"/>
  <ArrayType id="_1126" min="0" max="47u" type="_605" size="384" align="8"/>
  <Field id="_1127" name="__lock" type="_91" offset="0" context="_942" access="public" location="f15:119" file="f15" line="119"/>
  <Field id="_1128" name="__futex" type="_70" offset="32" context="_942" access="public" location="f15:120" file="f15" line="120"/>
  <Field id="_1129" name="__total_seq" type="_18" offset="64" context="_942" access="public" location="f15:121" file="f15" line="121"/>
  <Field id="_1130" name="__wakeup_seq" type="_18" offset="128" context="_942" access="public" location="f15:122" file="f15" line="122"/>
  <Field id="_1131" name="__woken_seq" type="_18" offset="192" context="_942" access="public" location="f15:123" file="f15" line="123"/>
  <Field id="_1132" name="__mutex" type="_200" offset="256" context="_942" access="public" location="f15:124" file="f15" line="124"/>
  <Field id="_1133" name="__nwaiters" type="_70" offset="288" context="_942" access="public" location="f15:125" file="f15" line="125"/>
  <Field id="_1134" name="__broadcast_seq" type="_70" offset="320" context="_942" access="public" location="f15:126" file="f15" line="126"/>
  <Destructor id="_1135" name="._8" artificial="1" throw="" context="_942" access="public" mangled="_ZN14pthread_cond_t3._8D1Ev *INTERNAL* " demangled="pthread_cond_t::._8::~._8()" location="f15:118" file="f15" line="118" endline="118" inline="1">
  </Destructor>
  <OperatorMethod id="_1136" name="=" returns="_1224" artificial="1" throw="" context="_942" access="public" mangled="_ZN14pthread_cond_t3._8aSERKS0_" demangled="pthread_cond_t::._8::operator=(pthread_cond_t::._8 const&amp;)" location="f15:118" file="f15" line="118" endline="118" inline="1">
    <Argument type="_1225" location="f15:118" file="f15" line="118"/>
  </OperatorMethod>
  <Constructor id="_1137" artificial="1" throw="" context="_942" access="public" mangled="_ZN14pthread_cond_t3._8C1ERKS0_ *INTERNAL* " demangled="pthread_cond_t::._8::._8(pthread_cond_t::._8 const&amp;)" location="f15:118" file="f15" line="118" endline="118" inline="1">
    <Argument type="_1225" location="f15:118" file="f15" line="118"/>
  </Constructor>
  <Constructor id="_1138" artificial="1" throw="" context="_942" access="public" mangled="_ZN14pthread_cond_t3._8C1Ev *INTERNAL* " demangled="pthread_cond_t::._8::._8()" location="f15:118" file="f15" line="118" inline="1"/>
  <ReferenceType id="_1139" type="_246" size="32" align="32"/>
  <ReferenceType id="_1140" type="_246c" size="32" align="32"/>
  <ArrayType id="_1141" min="0" max="19u" type="_605" size="160" align="8"/>
  <ReferenceType id="_1142" type="_252" size="32" align="32"/>
  <ReferenceType id="_1143" type="_252c" size="32" align="32"/>
  <ArrayType id="_1144" min="0" max="1u" type="_91" size="64" align="32"/>
  <ReferenceType id="_1145" type="_266" size="32" align="32"/>
  <ReferenceType id="_1146" type="_266c" size="32" align="32"/>
  <ReferenceType id="_1150" type="_347" size="32" align="32"/>
  <ReferenceType id="_1151" type="_347c" size="32" align="32"/>
  <ReferenceType id="_1153" type="_394" size="32" align="32"/>
  <ReferenceType id="_1154" type="_394c" size="32" align="32"/>
  <ArrayType id="_1156" min="0" max="7u" type="_605" size="64" align="8"/>
  <ReferenceType id="_1157" type="_428" size="32" align="32"/>
  <ReferenceType id="_1158" type="_428c" size="32" align="32"/>
  <PointerType id="_1159" type="_598" size="32" align="32"/>
  <ReferenceType id="_1160" type="_439" size="32" align="32"/>
  <ReferenceType id="_1161" type="_439c" size="32" align="32"/>
  <ArrayType id="_1162" min="0" max="35u" type="_605" size="288" align="8"/>
  <ReferenceType id="_1163" type="_475" size="32" align="32"/>
  <ReferenceType id="_1164" type="_475c" size="32" align="32"/>
  <ArrayType id="_1165" min="0" max="23u" type="_605" size="192" align="8"/>
  <Field id="_1166" name="__lock" type="_91" offset="0" context="_1028" access="public" location="f15:80" file="f15" line="80"/>
  <Field id="_1167" name="__count" type="_70" offset="32" context="_1028" access="public" location="f15:81" file="f15" line="81"/>
  <Field id="_1168" name="__owner" type="_91" offset="64" context="_1028" access="public" location="f15:82" file="f15" line="82"/>
  <Field id="_1169" name="__kind" type="_91" offset="96" context="_1028" access="public" location="f15:88" file="f15" line="88"/>
  <Field id="_1170" name="__nusers" type="_70" offset="128" context="_1028" access="public" location="f15:94" file="f15" line="94"/>
  <Field id="_1171" name="" type="_1172" offset="160" context="_1028" access="public" location="f15:99" file="f15" line="99"/>
  <Union id="_1172" context="_1028" access="public" mangled="N15pthread_mutex_t17__pthread_mutex_s3._5E" demangled="pthread_mutex_t::__pthread_mutex_s::._5" location="f15:96" file="f15" line="96" artificial="1" size="32" align="32" members="_1233 _1234 " bases=""/>
  <Destructor id="_1173" name="__pthread_mutex_s" artificial="1" throw="" context="_1028" access="public" mangled="_ZN15pthread_mutex_t17__pthread_mutex_sD1Ev *INTERNAL* " demangled="pthread_mutex_t::__pthread_mutex_s::~__pthread_mutex_s()" location="f15:79" file="f15" line="79" endline="79" inline="1">
  </Destructor>
  <OperatorMethod id="_1174" name="=" returns="_1235" artificial="1" throw="" context="_1028" access="public" mangled="_ZN15pthread_mutex_t17__pthread_mutex_saSERKS0_" demangled="pthread_mutex_t::__pthread_mutex_s::operator=(pthread_mutex_t::__pthread_mutex_s const&amp;)" location="f15:79" file="f15" line="79" endline="79" inline="1">
    <Argument type="_1236" location="f15:79" file="f15" line="79"/>
  </OperatorMethod>
  <Constructor id="_1175" name="__pthread_mutex_s" artificial="1" throw="" context="_1028" access="public" mangled="_ZN15pthread_mutex_t17__pthread_mutex_sC1ERKS0_ *INTERNAL* " demangled="pthread_mutex_t::__pthread_mutex_s::__pthread_mutex_s(pthread_mutex_t::__pthread_mutex_s const&amp;)" location="f15:79" file="f15" line="79" endline="79" inline="1">
    <Argument type="_1236" location="f15:79" file="f15" line="79"/>
  </Constructor>
  <Constructor id="_1176" name="__pthread_mutex_s" artificial="1" throw="" context="_1028" access="public" mangled="_ZN15pthread_mutex_t17__pthread_mutex_sC1Ev *INTERNAL* " demangled="pthread_mutex_t::__pthread_mutex_s::__pthread_mutex_s()" location="f15:79" file="f15" line="79" inline="1"/>
  <ReferenceType id="_1177" type="_476" size="32" align="32"/>
  <ReferenceType id="_1178" type="_476c" size="32" align="32"/>
  <ReferenceType id="_1181" type="_550" size="32" align="32"/>
  <ReferenceType id="_1182" type="_550c" size="32" align="32"/>
  <ReferenceType id="_1183" type="_598" size="32" align="32"/>
  <ReferenceType id="_1184" type="_598c" size="32" align="32"/>
  <ArrayType id="_1185" min="0" max="19u" type="_61" size="160" align="8"/>
  <ReferenceType id="_1186" type="_621" size="32" align="32"/>
  <ReferenceType id="_1187" type="_621c" size="32" align="32"/>
  <ReferenceType id="_1190" type="_671" size="32" align="32"/>
  <ReferenceType id="_1191" type="_671c" size="32" align="32"/>
  <ReferenceType id="_1192" type="_694" size="32" align="32"/>
  <ReferenceType id="_1193" type="_694c" size="32" align="32"/>
  <ArrayType id="_1194" min="0" max="31u" type="_605" size="256" align="8"/>
  <Field id="_1195" name="__lock" type="_91" offset="0" context="_1080" access="public" location="f15:172" file="f15" line="172"/>
  <Field id="_1196" name="__nr_readers" type="_70" offset="32" context="_1080" access="public" location="f15:173" file="f15" line="173"/>
  <Field id="_1197" name="__readers_wakeup" type="_70" offset="64" context="_1080" access="public" location="f15:174" file="f15" line="174"/>
  <Field id="_1198" name="__writer_wakeup" type="_70" offset="96" context="_1080" access="public" location="f15:175" file="f15" line="175"/>
  <Field id="_1199" name="__nr_readers_queued" type="_70" offset="128" context="_1080" access="public" location="f15:176" file="f15" line="176"/>
  <Field id="_1200" name="__nr_writers_queued" type="_70" offset="160" context="_1080" access="public" location="f15:177" file="f15" line="177"/>
  <Field id="_1201" name="__flags" type="_61" offset="192" context="_1080" access="public" location="f15:180" file="f15" line="180"/>
  <Field id="_1202" name="__shared" type="_61" offset="200" context="_1080" access="public" location="f15:181" file="f15" line="181"/>
  <Field id="_1203" name="__pad1" type="_61" offset="208" context="_1080" access="public" location="f15:182" file="f15" line="182"/>
  <Field id="_1204" name="__pad2" type="_61" offset="216" context="_1080" access="public" location="f15:183" file="f15" line="183"/>
  <Field id="_1205" name="__writer" type="_91" offset="224" context="_1080" access="public" location="f15:184" file="f15" line="184"/>
  <Destructor id="_1206" name="._11" artificial="1" throw="" context="_1080" access="public" mangled="_ZN16pthread_rwlock_t4._11D1Ev *INTERNAL* " demangled="pthread_rwlock_t::._11::~._11()" location="f15:171" file="f15" line="171" endline="171" inline="1">
  </Destructor>
  <OperatorMethod id="_1207" name="=" returns="_1242" artificial="1" throw="" context="_1080" access="public" mangled="_ZN16pthread_rwlock_t4._11aSERKS0_" demangled="pthread_rwlock_t::._11::operator=(pthread_rwlock_t::._11 const&amp;)" location="f15:171" file="f15" line="171" endline="171" inline="1">
    <Argument type="_1243" location="f15:171" file="f15" line="171"/>
  </OperatorMethod>
  <Constructor id="_1208" artificial="1" throw="" context="_1080" access="public" mangled="_ZN16pthread_rwlock_t4._11C1ERKS0_ *INTERNAL* " demangled="pthread_rwlock_t::._11::._11(pthread_rwlock_t::._11 const&amp;)" location="f15:171" file="f15" line="171" endline="171" inline="1">
    <Argument type="_1243" location="f15:171" file="f15" line="171"/>
  </Constructor>
  <Constructor id="_1209" artificial="1" throw="" context="_1080" access="public" mangled="_ZN16pthread_rwlock_t4._11C1Ev *INTERNAL* " demangled="pthread_rwlock_t::._11::._11()" location="f15:171" file="f15" line="171" inline="1"/>
  <ReferenceType id="_1210" type="_698" size="32" align="32"/>
  <ReferenceType id="_1211" type="_698c" size="32" align="32"/>
  <PointerType id="_1218" type="_338" size="32" align="32"/>
  <ReferenceType id="_1224" type="_942" size="32" align="32"/>
  <ReferenceType id="_1225" type="_942c" size="32" align="32"/>
  <Field id="_1233" name="__spins" type="_91" offset="0" context="_1172" access="public" location="f15:97" file="f15" line="97"/>
  <Field id="_1234" name="__list" type="_366" offset="0" context="_1172" access="public" location="f15:98" file="f15" line="98"/>
  <ReferenceType id="_1235" type="_1028" size="32" align="32"/>
  <ReferenceType id="_1236" type="_1028c" size="32" align="32"/>
  <ReferenceType id="_1242" type="_1080" size="32" align="32"/>
  <ReferenceType id="_1243" type="_1080c" size="32" align="32"/>
  <CvQualifiedType id="_605c" type="_605" const="1"/>
  <CvQualifiedType id="_827c" type="_827" const="1"/>
  <CvQualifiedType id="_266c" type="_266" const="1"/>
  <CvQualifiedType id="_347c" type="_347" const="1"/>
  <CvQualifiedType id="_13c" type="_13" const="1"/>
  <CvQualifiedType id="_3c" type="_3" const="1"/>
  <CvQualifiedType id="_173c" type="_173" const="1"/>
  <CvQualifiedType id="_91c" type="_91" const="1"/>
  <CvQualifiedType id="_185c" type="_185" const="1"/>
  <CvQualifiedType id="_83c" type="_83" const="1"/>
  <CvQualifiedType id="_54c" type="_54" const="1"/>
  <CvQualifiedType id="_11c" type="_11" const="1"/>
  <CvQualifiedType id="_175c" type="_175" const="1"/>
  <CvQualifiedType id="_475c" type="_475" const="1"/>
  <CvQualifiedType id="_56c" type="_56" const="1"/>
  <CvQualifiedType id="_1028c" type="_1028" const="1"/>
  <CvQualifiedType id="_476c" type="_476" const="1"/>
  <CvQualifiedType id="_166c" type="_166" const="1"/>
  <CvQualifiedType id="_942c" type="_942" const="1"/>
  <CvQualifiedType id="_246c" type="_246" const="1"/>
  <CvQualifiedType id="_183c" type="_183" const="1"/>
  <CvQualifiedType id="_1080c" type="_1080" const="1"/>
  <CvQualifiedType id="_698c" type="_698" const="1"/>
  <CvQualifiedType id="_428c" type="_428" const="1"/>
  <CvQualifiedType id="_252c" type="_252" const="1"/>
  <CvQualifiedType id="_394c" type="_394" const="1"/>
  <CvQualifiedType id="_677c" type="_677" const="1"/>
  <FunctionType id="_1062" returns="_201">
    <Argument type="_201"/>
    <Argument type="_381"/>
    <Argument type="_381"/>
  </FunctionType>
  <FunctionType id="_833" returns="_827">
    <Argument type="_201"/>
    <Argument type="_201"/>
  </FunctionType>
  <CvQualifiedType id="_439c" type="_439" const="1"/>
  <CvQualifiedType id="_229c" type="_229" const="1"/>
  <CvQualifiedType id="_62c" type="_62" const="1"/>
  <FunctionType id="_938" returns="_70">
    <Argument type="_200"/>
    <Argument type="_1248"/>
  </FunctionType>
  <FunctionType id="_849" returns="_91">
    <Argument type="_200"/>
    <Argument type="_854"/>
    <Argument type="_70"/>
  </FunctionType>
  <CvQualifiedType id="_598c" type="_598" const="1"/>
  <CvQualifiedType id="_284c" type="_284" const="1"/>
  <CvQualifiedType id="_694c" type="_694" const="1"/>
  <CvQualifiedType id="_550c" type="_550" const="1"/>
  <CvQualifiedType id="_621c" type="_621" const="1"/>
  <CvQualifiedType id="_61c" type="_61" const="1"/>
  <CvQualifiedType id="_551c" type="_551" const="1"/>
  <CvQualifiedType id="_671c" type="_671" const="1"/>
  <CvQualifiedType id="_138c" type="_138" const="1"/>
  <CvQualifiedType id="_654c" type="_654" const="1"/>
  <CvQualifiedType id="_136c" type="_136" const="1"/>
  <CvQualifiedType id="_186c" type="_186" const="1"/>
  <CvQualifiedType id="_187c" type="_187" const="1"/>
  <PointerType id="_1248" type="_854" size="32" align="32"/>
  <File id="f0" name="/usr/include/time.h"/>
  <File id="f1" name="/usr/include/unistd.h"/>
  <File id="f2" name="/usr/share/gccxml-0.9/GCC/4.4/gccxml_builtins.h"/>
  <File id="f3" name="/usr/include/bits/unistd.h"/>
  <File id="f4" name="/usr/include/zlib.h"/>
  <File id="f5" name="/usr/include/bits/time.h"/>
  <File id="f6" name="/usr/include/sys/types.h"/>
  <File id="f7" name="/usr/include/stdint.h"/>
  <File id="f8" name="../libgit2/include/git2/index.h"/>
  <File id="f9" name="../libgit2/include/git2/object.h"/>
  <File id="f10" name="../libgit2/include/git2/repository.h"/>
  <File id="f11" name="../libgit2/include/git2/odb.h"/>
  <File id="f12" name="/usr/include/bits/types.h"/>
